# Pandas

In [1]:
import numpy as np
import pandas as pd

## Converting List into series of elments

In [4]:
my_list = [8,4,3,2,1,0,8,1]
pd.Series(data=my_list)

0    8
1    4
2    3
3    2
4    1
5    0
6    8
7    1
dtype: int64

## Convering Dictionary into series of elements

In [5]:
my_dict = {'a':0,'b':1,'c':2,'d':3}
pd.Series(data=my_dict)

a    0
b    1
c    2
d    3
dtype: int64

## Addition of two series

In [24]:
ser1 = pd.Series([1,2,3,5,4], ["India","China","Nepal","Russia","Bhutan"])
ser2 = pd.Series([1,2,3,4,5], ["India","China","Nepal","Bhutan","Russia"])
ser3 = pd.Series([1,2,3,4], ["India","China","Nepal","Russia"])

ser4 = ser1+ser2
ser5 = ser1+ser3

print("\nSeries 1:")
print(ser1)
print("\nSeries 2:")
print(ser2)
print("\nSeries 3:")
print(ser3)
print("\nSeries Sum of 1 and 2:")
print(ser4)
print("\nSeries Sum of 1 and 3:")
print(ser5)

Series 1:
India     1
China     2
Nepal     3
Russia    5
Bhutan    4
dtype: int64

Series 2:
India     1
China     2
Nepal     3
Bhutan    4
Russia    5
dtype: int64

Series 3:
India     1
China     2
Nepal     3
Russia    4
dtype: int64

Series Sum of 1 and 2:
Bhutan     8
China      4
India      2
Nepal      6
Russia    10
dtype: int64

Series Sum of 1 and 3:
Bhutan    NaN
China     4.0
India     2.0
Nepal     6.0
Russia    9.0
dtype: float64

## Converting into Dataframe and Indexing

In [27]:
dict1 = {"Name":["A","B","C"], "Age":[10,13,9]}
df = pd.DataFrame(dict1, index=['rank1','rank2','rank3'])
print(df)

      Name  Age
rank1    A   10
rank2    B   13
rank3    C    9

### To Display as Table

In [28]:
df #don't use print function

      Name  Age
rank1    A   10
rank2    B   13
rank3    C    9

## Create Dataframe and Select Columns

In [32]:
from numpy.random import randn

In [45]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [46]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [47]:
df[['W']]

          W
A -0.993263
B  1.025984
C  2.154846
D  0.147027
E -0.925874

In [48]:
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

## Data Manipulation

In [50]:
df1 = df.drop('W', axis=1)

In [51]:
df1

          X         Y         Z
A  0.196800 -1.136645  0.000366
B -0.156598 -0.031579  0.649826
C -0.610259 -0.755325 -0.346419
D -0.479448  0.558769  1.024810
E  1.862864 -1.133817  0.610478

In [52]:
# Fetching particular row and column
df.loc[['A','C'],['X','Z']]

          X         Z
A  0.196800  0.000366
C -0.610259 -0.346419

## Pandas CSV

In [60]:
df = pd.read_csv('res\german_credit_data.csv')
df

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car
...,...,...,...,...,...,...,...,...,...,...
995,995,31,female,1,own,little,NaN,1736,12,furniture/equipment
996,996,40,male,3,own,little,little,3857,30,car
997,997,38,male,2,own,little,NaN,804,12,radio/TV
998,998,23,male,2,free,little,little,1845,45,radio/TV
999,999,27,male,2,own,moderate,moderate,4576,45,car